import { ICardState } from './interfaces';

export const CARD_STATE: ICardState = {
  cardА1: {
    title: 'Уровень А1. Beginner и Elementary',
    text:
      'Здесь ваш словарный запас расширяется до 1000. Своим новым друзьям англичанам вы уже сможете поведать о себе, своей семье, о том, где живете и чем занимаетесь. Но на уровне общих фраз и повседневных поверхностных разговоров.',
  },
  cardА2: {
    title: 'Уровень А2. Pre-Intermediate',
    text:
      'Около 2000 слов станут доступны вам на уровне А2. Это значит, что вы уже перестали заикаться от волнения, когда вас спрашивают что-то о жизненных взглядах, досуге или предстоящих путешествиях.',
  },
  cardB1: {
    title: 'Уровень B1. Intermediate',
    text:
      'Вы уже на довольно уверенном уровне с запасом слов в 3000 единиц. Уже не страшно оказаться одному в англоязычном городе и спросить дорогу до аэропорта. А иногда и самому подробно описать её затерявшемуся туристу уровня А1.',
  },
  cardB2: {
    title: 'Уровень B2. Upper-Intermediate',
    text:
      'На этом этапе вы уже не можете ударить в грязь лицом и должны ловко владеть словарным запасом в 4000 слов. Всё необходимое для общения  с носителями языка у вас уже есть: хорошая скорость восприятия чужой речи, способность в устной и письменной форме выражать свои мысли.',
  },
  cardC1: {
    title: 'Уровень C1. Advanced',
    text:
      'Заметьте, вы уже давно перешагнули порог в 3000 слов. Более 90% подаваемой информации в статьях, книгах, новостях и фильмах более чем доступна. Кстати, на уровне Advanced вы уже даже не задумываетесь, а сколько же слов из Оксфордского словаря уже знаете..?',
  },
  cardC2: {
    title: 'Уровень C2. Proficiency',
    text:
      'Уровень носителя языка. В идеале здесь ваш словарный запас достигает таких высот, что сложно сосчитать: более 6500 слов. Даже если вам «подсунут» в ходе беседы высокообразованного англичанина, вы не растеряетесь и в красках расскажете ему о своей диссертации.',
  },
  cardDifficult: {
    title: 'Сложные слова',
    text: 'Этот раздел состоит из слов, которые вы отметили как сложные.',
  },
};
